---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampStartHigherThanEnd
source: html/0162ef77-bb55-b42f-4af5-c0b4c8d25bea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampStartHigherThanEnd Property

The ramp's base (base level + base offset) must be below its top (top level + top offset).

## Syntax (C#)
```csharp
public static FailureDefinitionId RampStartHigherThanEnd { get; }
```